Revit 2026 API

# BuiltInFailuresPartMakerMethodForMergePartFailures Class

---

Failures related to part merge operations.

SystemObject Autodesk.Revit.DBBuiltInFailuresPartMakerMethodForMergePartFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PartMakerMethodForMergePartFailures
```
```vb
Public NotInheritable Class PartMakerMethodForMergePartFailures
```
```cpp
public ref class PartMakerMethodForMergePartFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PartMakerMethodForMergePartFailures = class end
```

The BuiltInFailuresPartMakerMethodForMergePartFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MergedPartHasDisConnectedGeometries | A merged part geometry has dis-connected components. |
|  | NeedTwoPartsToMerge | Attempt to merge fewer than two parts. There must be at least two. No part will be produced. |
|  | PartNotIncludedInMerge | This part is not geometrically coincident with another part of the same material. No merge possible. |
|  | PartsCannotBeMerged | This PartMaker refers to parts which cannot be merged. |
|  | UnableToIncludePartInMerge | Attempt to merge this Part results in failure of boolean operation. Cannot compute combined geometry. |

#### Reference

Autodesk.Revit.DB Namespace